app/controllers/api/comments_controller.rb

  def show
    @comment = Comment.includes(:likes).find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("author_id", "story_id", "body", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 1481], ["story_id", 1], ["body", "valid comment body"], ["date", "2017-11-12"], ["created_at", "2017-11-12 22:05:36.477627"], ["updated_at", "2017-11-12 22:05:36.477627"]]

  def update
    @comment = Comment.includes(:likes).find(params[:id])
    if @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "Updated Body"], ["updated_at", "2017-11-12 22:05:36.987074"], ["id", 4]]