app/controllers/api/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.includes(:author, :likes)

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 999]]
SELECT "comments".* FROM "comments" WHERE "comments"."story_id" IN (31)
---
  def show
    @story = Story.includes(:comments, :author, :comment_authors).find(params[:id])

INSERT INTO "stories" ("body", "title", "description", "date", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @story = Story.new(story_params)
    if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 122]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 122]]
---
  def destroy
    story = Story.find(params[:id])
    story.destroy

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 32]]
UPDATE "stories" SET "date" = $1, "title" = $2, "updated_at" = $3 WHERE "stories"."id" = $4  [["date", "2017-11-12"], ["title", "New Title"], ["updated_at", "2017-11-12 19:33:26.402299"], ["id", 32]]
---
  def update
    debugger
    @story = Story.find(params[:id])
    if @story.update(story_params)