app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "bio") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "validname"], ["password_digest", "$2a$10$hwVm2cDQKOFRb2tfyUPzkOixSXEp/eqLjuKLx92vy5q1L0Ba1xo1u"], ["session_token", "4RjjAXKiWu01nWEsfmLVdw"], ["bio", ""]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".id FROM "users" INNER JOIN "follows" ON "users"."id" = "follows"."author_id" WHERE "follows"."follower_id" = $1  [["follower_id", 924]]
INSERT INTO "follows" ("author_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 925], ["follower_id", 924], ["created_at", "2017-11-12 17:49:42.029324"], ["updated_at", "2017-11-12 17:49:42.029324"]]
---
  def follow
    @user = User.includes(:comments, :followees, :followers).find(params[:id])

    follow = Follow.new({author_id: @user.id, follower_id: current_user.id})
    if follow.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1077]]
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" IN (1077)
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."author_id" = $2  [["follower_id", 1076], ["author_id", 1077]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 20]]
---
  def unfollow
    @user = User.includes(:comments, :followees, :followers).find(params[:id])
    @follow = Follow.where({author_id: @user.id, follower_id: current_user.id })[0]
    Follow.destroy(@follow.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1276]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "New Name"], ["id", 1277]]
---
  def update
    @user = User.find(params[:id])
    if @user.username === "Guest"
      render :show
      return
    end
    if @user.update(user_params)