app/views/api/stories/show.json.jbuilder

  json.comments do
     @story.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = $1  [["story_id", 32]]